app/controllers/admins_controller.rb

  def update
    @admin.update(admin_params)
---
UPDATE "admins" SET "website" = ?, "twitter" = ?, "linkedin" = ?, "instagram" = ?, "github" = ?, "bio" = ?, "facebook" = ?, "updated_at" = ? WHERE "admins"."id" = ?

  def dashboard
    @articles = current_admin.articles.paginate(:per_page => 10, :page => params[:page])
---
SELECT "articles".* FROM "articles" WHERE "articles"."admin_id" = ?  [["admin_id", 2]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."admin_id" = ?  [["admin_id", 2]]