app/controllers/pages_controller.rb

    def home
        @latest_posts = Article.published.where(project_id: nil)
        .order("created_at DESC")
        .limit(10)
        .paginate(page: params[:page], per_page: 10)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL ORDER BY created_at DESC LIMIT ? OFFSET ?  [["published", "t"], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "articles" WHERE "articles"."published" = ? AND "articles"."project_id" IS NULL ORDER BY created_at DESC LIMIT ?) subquery_for_count  [["published", "t"], ["LIMIT", 10]]

    def latest
        @article = Article.last
---
SELECT  "articles".* FROM "articles" ORDER BY "articles"."id" DESC LIMIT ?  [["LIMIT", 1]]