app/models/article.rb

    scope :not_associated_with_project, -> { where(project_id: nil) }

    before_create { self.description = "No description available" if self.description.nil? }
    after_create { Commentable.create(object_id: id, object_type: self.class.name) }
---
INSERT INTO "commentables" ("object_id", "created_at", "updated_at", "object_type") VALUES (?, ?, ?, ?)  [["object_id", 1], ["created_at", "2021-07-30 15:06:35.861888"], ["updated_at", "2021-07-30 15:06:35.861888"], ["object_type", "Article"]]

    def series
        Series.find_by(id: series_id)
---
SELECT  "series".* FROM "series" WHERE "series"."id" IS NULL LIMIT ?  [["LIMIT", 1]]

    def commentable
        Commentable.find_by(object_id: self.id, object_type: self.class.name)
---
SELECT  "commentables".* FROM "commentables" WHERE "commentables"."object_id" = ? AND "commentables"."object_type" = ? LIMIT ?  [["object_id", 1], ["object_type", "Article"], ["LIMIT", 1]]

    def project
        Project.find_by(id: project_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" IS NULL LIMIT ?  [["LIMIT", 1]]